configuration/src/Catalogs/РолиПользователей/РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиПользователей</name>
  <comment>Список возможных ролей пользователя</comment>
  <predefined>
    <items>
      <name>Аналитик</name>
      <description>Аналитик</description>
    </items>
    <items>
      <name>ВсеРоли</name>
      <description>Все роли</description>
    </items>
    <items>
      <name>Гость</name>
      <description>Гость</description>
    </items>
    <items>
      <name>ДиректорIT</name>
      <description>Директор IT</description>
    </items>
    <items>
      <name>Заказчик</name>
      <description>Заказчик</description>
    </items>
    <items>
      <name>Разработчик</name>
      <description>Разработчик</description>
    </items>
    <items>
      <name>РуководительIT</name>
      <description>Руководитель ИТ-отдела</description>
    </items>
    <items>
      <name>РуководительНаправления</name>
      <description>Руководитель направления</description>
    </items>
    <items>
      <name>РуководительНаправленияIT</name>
      <description>Руководитель направления IT</description>
    </items>
    <items>
      <name>СтаршийРазработчик</name>
      <description>Старший разработчик</description>
    </items>
    <items>
      <name>СТО</name>
      <description>СТО</description>
    </items>
    <items>
      <name>Тестировщик</name>
      <description>Тестировщик</description>
    </items>
  </predefined>
  <attributes>
    <name>ПринадлежитITОтделу</name>
    <comment>Истина - определяет роль пользователя в IT-структуре, Ложь - роль пользователя по отношению к объектам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеИнструменты</name>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.ИнструментыСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОтчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/ЛичныеДела/ЛичныеДела.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛичныеДела</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.Филиалы</types>
      <types>String</types>
      <types>Date</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияПоЛичнымДелам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/СобытияПоЛичнымДелам/СобытияПоЛичнымДелам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияПоЛичнымДелам</name>
  <enumValues>
    <name>МестоРаботыРегл</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВДругоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВКастомнуюКоманду</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВКоманду</name>
  </enumValues>
  <enumValues>
    <name>ПринятНаДолжность</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/РолиПользователей/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.РолиПользователей.ПроверитьПредопределенныеЭлементы";
	
КонецПроцедуры

Процедура ЗаполнитьИнструментыРолей(ИнструментыСистемы) Экспорт
	
	ЗаказчикОбъект = Заказчик.ПолучитьОбъект();
	ЗаказчикОбъект.ДоступныеИнструменты.Очистить();
	
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Очередь заявок", 0);
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Заявки на доработку", 1);
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Проекты", 2);
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Внутренние задания", 3);
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Заявки на разработку", 4);
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Создать заявку на разработку", 5);
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Проекты по специалисту", 6);
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Канбан", 7);
	ДобавитьИнструментРоли(ЗаказчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Трудозатраты", 8);
	ЗаказчикОбъект.Записать();
	
	РазработчикОбъект = Разработчик.ПолучитьОбъект();
	РазработчикОбъект.ДоступныеИнструменты.Очистить();
	ДобавитьИнструментРоли(РазработчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Управление нагрузкой", 0);
	ДобавитьИнструментРоли(РазработчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Очередь заявок", 1);
	ДобавитьИнструментРоли(РазработчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Канбан", 2);
	ДобавитьИнструментРоли(РазработчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Мои задачи", 3);
	ДобавитьИнструментРоли(РазработчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Создать задачу", 4);
	ДобавитьИнструментРоли(РазработчикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Трудозатраты", 5);
	РазработчикОбъект.Записать();
	
	РуководительОбъект = РуководительIT.ПолучитьОбъект();
	РуководительОбъект.ДоступныеИнструменты.Очистить();
	
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Очередь заявок", 0);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Разработка", 1);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Контроль", 2);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Настройки филиала", 3);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Создать заявку на разработку", 4);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Быстрое создание задачи", 5);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Внутренние трудозатраты", 6);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Трудозатраты", 7);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Мои задачи", 8);
	ДобавитьИнструментРоли(РуководительОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Канбан", 9);
	РуководительОбъект.Записать();
	
	ТестировщикОбъект = Тестировщик.ПолучитьОбъект();
	ТестировщикОбъект.ДоступныеИнструменты.Очистить();
	
	ДобавитьИнструментРоли(ТестировщикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Пул на тестирование", 0);
	ДобавитьИнструментРоли(ТестировщикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Мои задачи QA", 1);
	ДобавитьИнструментРоли(ТестировщикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "На разработку QA", 2);
	ДобавитьИнструментРоли(ТестировщикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Управление нагрузкой", 3);
	ДобавитьИнструментРоли(ТестировщикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Очередь заявок", 4);
	ДобавитьИнструментРоли(ТестировщикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Канбан", 5);
	ДобавитьИнструментРоли(ТестировщикОбъект.ДоступныеИнструменты, ИнструментыСистемы, "Трудозатраты", 6);
	ТестировщикОбъект.Записать();
	
КонецПроцедуры

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеЭлементы() Экспорт
	
	ЗаполнитьПредопределенныйЭлемент("Аналитик", "Аналитик");
	ЗаполнитьПредопределенныйЭлемент("ВсеРоли", "Все роли");
	ЗаполнитьПредопределенныйЭлемент("Гость", "Гость");
	ЗаполнитьПредопределенныйЭлемент("ДиректорIT", "Директор IT", Истина);
	ЗаполнитьПредопределенныйЭлемент("Заказчик", "Заказчик");
	ЗаполнитьПредопределенныйЭлемент("Разработчик", "Разработчик", Истина);
	ЗаполнитьПредопределенныйЭлемент("РуководительIT", "Руководитель ИТ-отдела", Истина);
	ЗаполнитьПредопределенныйЭлемент("РуководительНаправления", "Руководитель направления");
	ЗаполнитьПредопределенныйЭлемент("РуководительНаправленияIT", "Руководитель направления IT", Истина);
	ЗаполнитьПредопределенныйЭлемент("СтаршийРазработчик", "Старший разработчик", Истина);
	ЗаполнитьПредопределенныйЭлемент("СТО", "СТО");
	ЗаполнитьПредопределенныйЭлемент("Тестировщик", "Тестировщик", Истина);
	
КонецПроцедуры

// Возвращает роль пользователя на дату
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
//  Дата		 - Дата							 - Дата, на которую нужно получить роль
// 
// Возвращаемое значение:
//  СправочникСсылка.РолиПользователей - роль пользователя на дату
//
Функция ПолучитьРольПользователя(Знач Пользователь, Знач Дата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Должности.РольВОтделеIT КАК РольВОтделеIT
	|ИЗ
	|	РегистрСведений.ЛичныеДела.СрезПоследних(
	|			&Дата,
	|			Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоЛичнымДелам.ПринятНаДолжность)
	|				И Сотрудник = &Пользователь) КАК ЛичныеДелаСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО ЛичныеДелаСрезПоследних.Данные = Должности.Ссылка";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Дата", Дата);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.РольВОтделеIT;
	Иначе
		Результат = Справочники.РолиПользователей.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьИнструментРоли(ТабличнаяЧасть, ИнструментыСистемы, НаименованиеИнструмента, Порядок)
	
	НоваяСтрока = ТабличнаяЧасть.Добавить();
	НоваяСтрока.Инструмент = ИнструментыСистемы.Получить(НаименованиеИнструмента);
	НоваяСтрока.Порядок = Порядок;
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныйЭлемент(ИмяЭлемента, Наименование, ПринадлежитITОтделу = Ложь) 
	
	Попытка
		Роль = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.РолиПользователей." + ИмяЭлемента);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.РолиПользователей." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	НужнаЗапись = Ложь;
	
	Если Роль = Неопределено Тогда
		Роль = Справочники.РолиПользователей.СоздатьЭлемент();
		Роль.ИмяПредопределенныхДанных = ИмяЭлемента;
		Роль.Наименование = Наименование;
		Роль.ПринадлежитITОтделу = ПринадлежитITОтделу;
		
		НужнаЗапись = Истина;
	Иначе
		Роль = Роль.ПолучитьОбъект();
		
		Если Роль.ПринадлежитITОтделу <> ПринадлежитITОтделу Тогда
			Роль.ПринадлежитITОтделу = ПринадлежитITОтделу;
			НужнаЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НужнаЗапись Тогда
		Роль.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
